From inspecting the execution plan, there's one particular attribute (`server_side_encryption_configuration`) that I suspect causing the problem
```
  # awscc_kendra_index.example must be replaced
-/+ resource "awscc_kendra_index" "example" {
      ~ arn                                  = "arn:aws:kendra:us-east-1:###########:index/b579a25c-02e7-4736-8d4e-726df3f7e7fd" -> (known after apply)
      + capacity_units                       = (known after apply)
      ~ document_metadata_configurations     = [
         . . .
        ] -> (known after apply)
      ~ id                                   = "b579a25c-02e7-4736-8d4e-726df3f7e7fd" -> (known after apply)
      ~ index_id                             = "b579a25c-02e7-4736-8d4e-726df3f7e7fd" -> (known after apply)
        name                                 = "example-index"
      + server_side_encryption_configuration = (known after apply) # forces replacement
        tags                                 = [
            {
                key   = "Modified By"
                value = "AWSCC"
            },
        ]
      ~ user_context_policy                  = "ATTRIBUTE_FILTER" -> (known after apply)
      + user_token_configurations            = (known after apply)
        # (3 unchanged attributes hidden)
    }
```